bigroot969/VSCode_STM32_Demo/Hardware/Menu.c
#include "stm32f10x.h" // Device header
#include "LCD.h"
#include "Key.h"
#include "Menu.h"
#include "MyRTC.h"
#include "LightSensor.h"
#include "TempSensor.h"
#include "Buzzer.h"
#include "DataStorage.h"
#include "stdio.h"

#define Music_Count 5

uint8_t Music = 1;

extern int MyRTC_Time[];
int SaveInterval_Time[3];
extern uint8_t MaxRecordCount;
DateTime CurrentTime;
int SaveInterval = 10;
uint8_t StopWatchStartFlag = 0;
uint8_t hour, minute, second;
uint8_t Flag = 1;
uint8_t StepLength = 5;
uint16_t LightValue = 400;
uint8_t TempValue = 35;
uint8_t ToggleSaveFlag = 0;
uint8_t NowTotalRecords;
uint8_t ShowRecordID = 0;
float Temp = 0;
uint16_t Light = 0;
volatile uint8_t SaveFlag = 0;
volatile uint16_t TimerCount = 0;

int Menu1(void) // 一级菜单
{
	LCD_Clear(WHITE);
	LCD_ShowChinese(0, 32, "状态信息", LCD_16X16, BLACK, WHITE, 1);
	LCD_ShowChinese(0, 56, "历史数据", LCD_16X16, BLACK, WHITE, 1);
	LCD_ShowChinese(0, 80, "功能", LCD_16X16, BLACK, WHITE, 1);
	LCD_ShowChinese(0, 104, "设置", LCD_16X16, BLACK, WHITE, 1);
	while (1)
	{
		if (Key_Check(KEY_1, KEY_UP) || Key_Check(KEY_1, KEY_REPEAT))
		{
			Flag--;
			if (Flag == 0)
			{
				Flag = 4;
			}
		}
		if (Key_Check(KEY_2, KEY_UP) || Key_Check(KEY_2, KEY_REPEAT))
		{
			Flag++;
			if (Flag == 5)
			{
				Flag = 1;
			}
		}
		if (Key_Check(KEY_3, KEY_SINGLE))
		{
			LCD_Clear(WHITE);
			return Flag;
		}
		switch (Flag)
		{
		case 1:
		{
			LCD_ShowChinese(0, 32, "状态信息", LCD_16X16, WHITE, BLACK, 1);
			LCD_ShowChinese(0, 56, "历史数据", LCD_16X16, BLACK, WHITE, 1);
			LCD_ShowChinese(0, 80, "功能", LCD_16X16, BLACK, WHITE, 1);
			LCD_ShowChinese(0, 104, "设置", LCD_16X16, BLACK, WHITE, 1);
			break;
		}
		case 2:
		{
			LCD_ShowChinese(0, 32, "状态信息", LCD_16X16, BLACK, WHITE, 1);
			LCD_ShowChinese(0, 56, "历史数据", LCD_16X16, WHITE, BLACK, 1);
			LCD_ShowChinese(0, 80, "功能", LCD_16X16, BLACK, WHITE, 1);
			LCD_ShowChinese(0, 104, "设置", LCD_16X16, BLACK, WHITE, 1);
			break;
		}
		case 3:
		{
			LCD_ShowChinese(0, 32, "状态信息", LCD_16X16, BLACK, WHITE, 1);
			LCD_ShowChinese(0, 56, "历史数据", LCD_16X16, BLACK, WHITE, 1);
			LCD_ShowChinese(0, 80, "功能", LCD_16X16, WHITE, BLACK, 1);
			LCD_ShowChinese(0, 104, "设置", LCD_16X16, BLACK, WHITE, 1);
			break;
		}
		case 4:
		{
			LCD_ShowChinese(0, 32, "状态信息", LCD_16X16, BLACK, WHITE, 1);
			LCD_ShowChinese(0, 56, "历史数据", LCD_16X16, BLACK, WHITE, 1);
			LCD_ShowChinese(0, 80, "功能", LCD_16X16, BLACK, WHITE, 1);
			LCD_ShowChinese(0, 104, "设置", LCD_16X16, WHITE, BLACK, 1);
			break;
		}
		}
	}
}

int Menu2_Stats(void) // 二级菜单
{
	uint8_t StFlag = 1;
	uint8_t Menu2_StatsFlag = 0;
	uint8_t AlarmActiveFlag = 0;
	uint8_t AlarmCounter = 0;
	uint8_t LastAlarmState = 0; // 上次报警状态，用于检测状态变化
	const uint16_t MAX_ALARM_TICKS = 5;

	LCD_ShowChinese(0, 0, "状态信息", LCD_16X16, BLACK, WHITE, 1);
	LCD_ShowChinese(0, 20, "<---", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 80, "光照(lux):", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 40, "日期:", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 60, "时间:", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 100, "温度(C):", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowString(72, 40, "-", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowString(96, 40, "-", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowString(56, 60, ":", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowString(80, 60, ":", LCD_8X16, BLACK, WHITE, 0);

	while (1)
	{
		if (Key_Check(KEY_3, KEY_SINGLE))
		{
			LCD_Clear(WHITE);
			Buzzer_OFF();
			Menu2_StatsFlag = StFlag;
		}
		if (Menu2_StatsFlag == 1)
		{
			return 0;
		}
		switch (StFlag)
		{
		case 1:
		{
			LCD_ShowString(0, 20, "<---", LCD_8X16, WHITE, BLACK, 0);
			break;
		}
		}

		// 读取传感器数据
		MyRTC_ReadTime();
		Light = LDR_LuxData();
		Temp = Temp_Average_Data();

		// 显示时间
		LCD_ShowNum(40, 40, MyRTC_Time[0], LCD_8X16, BLACK, WHITE, 0, 0, 4);  // 年
		LCD_ShowNum(80, 40, MyRTC_Time[1], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 月
		LCD_ShowNum(104, 40, MyRTC_Time[2], LCD_8X16, BLACK, WHITE, 0, 1, 2); // 日
		LCD_ShowNum(40, 60, MyRTC_Time[3], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 时
		LCD_ShowNum(64, 60, MyRTC_Time[4], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 分
		LCD_ShowNum(88, 60, MyRTC_Time[5], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 秒

		// 自动存储处理
		if (SaveFlag == 1 && ToggleSaveFlag == 1)
		{
			SaveFlag = 0;
			CurrentTime.Year = MyRTC_Time[0];
			CurrentTime.Month = MyRTC_Time[1];
			CurrentTime.Day = MyRTC_Time[2];
			CurrentTime.Hour = MyRTC_Time[3];
			CurrentTime.Minute = MyRTC_Time[4];
			CurrentTime.Second = MyRTC_Time[5];
			// 读取实时传感器数据
			float tempData = DS18B20_Get_Temp();
			uint16_t lightData = LDR_LuxData();
			uint8_t saveResult = DataStorage_Save(tempData, lightData, &CurrentTime);
			if (saveResult == 1)
			{
				ToggleSaveFlag = 0; // 存储已满
			}
		}

		// 持续显示存储状态
		if (ToggleSaveFlag == 1)
		{
			LCD_ShowChinese(80, 140, "存储中", LCD_16X16, BLUE, WHITE, 1);
		}
		else
		{
			NowTotalRecords = DataStorage_GetCount();
			if (NowTotalRecords >= MaxRecordCount)
			{
				LCD_ShowChinese(80, 140, " 已满 ", LCD_16X16, RED, WHITE, 1);
			}
		}

		// 判断是否需要报警
		uint8_t CurrentAlarmState = (Temp >= TempValue || Light >= LightValue) ? 1 : 0;

		// 只在状态变化时更新中文标签，减少闪烁
		if (CurrentAlarmState != LastAlarmState)
		{
			if (CurrentAlarmState)
			{
				LCD_ShowChinese(0, 80, "光照(lux):", LCD_16X16, RED, WHITE, 0);
				LCD_ShowChinese(0, 100, "温度(C):", LCD_16X16, RED, WHITE, 0);
			}
			else
			{
				LCD_ShowChinese(0, 80, "光照(lux):", LCD_16X16, BLACK, WHITE, 0);
				LCD_ShowChinese(0, 100, "温度(C):", LCD_16X16, BLACK, WHITE, 0);
			}
			LastAlarmState = CurrentAlarmState;
		}

		// 显示数值（使用当前状态的颜色）
		uint16_t displayColor = CurrentAlarmState ? RED : BLACK;
		LCD_ShowNum(88, 80, Light, LCD_8X16, displayColor, WHITE, 0, 1, 3);
		// 清除温度显示区域，防止字符残留
		LCD_DrawRectangle_Fill(72, 100, 120, 115, WHITE);
		LCD_ShowFloatNum(72, 100, Temp, 1, LCD_8X16, displayColor, WHITE, 0);

		// 报警逻辑处理
		if (CurrentAlarmState)
		{
			if (!AlarmActiveFlag)
			{
				Buzzer_ON();
				AlarmActiveFlag = 1;
				AlarmCounter = 0;
			}
			else
			{
				AlarmCounter++;
				if (AlarmCounter >= MAX_ALARM_TICKS)
				{
					Buzzer_OFF();
					AlarmActiveFlag = 0;
				}
			}
		}
		else
		{
			if (AlarmActiveFlag)
			{
				Buzzer_OFF();
				AlarmActiveFlag = 0;
				AlarmCounter = 0;
			}
		}
	}
}

int Menu2_Setting(void)
{
	uint8_t Menu3_Set = 0;
	uint8_t SetFlag = 1;
	LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 40, "日期时间", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 60, "光照阈值", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 80, "温度阈值", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 100, "单次步长", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 0, "设置", LCD_16X16, BLACK, WHITE, 1);
	while (1)
	{
		// 自动存储处理（读取实时传感器数据）
		if (SaveFlag == 1 && ToggleSaveFlag == 1)
		{
			SaveFlag = 0;
			MyRTC_ReadTime();
			CurrentTime.Year = MyRTC_Time[0];
			CurrentTime.Month = MyRTC_Time[1];
			CurrentTime.Day = MyRTC_Time[2];
			CurrentTime.Hour = MyRTC_Time[3];
			CurrentTime.Minute = MyRTC_Time[4];
			CurrentTime.Second = MyRTC_Time[5];
			// 读取实时传感器数据
			float tempData = DS18B20_Get_Temp();
			uint16_t lightData = LDR_LuxData();
			uint8_t saveResult = DataStorage_Save(tempData, lightData, &CurrentTime);
			if (saveResult == 1)
			{
				ToggleSaveFlag = 0; // 存储已满
			}
		}

