bigroot969/VSCode_STM32_Demo/Hardware/Menu.c
		case 2:																	  // 设置月份
			LCD_ShowNum(40, 40, MyRTC_Time[0], LCD_8X16, BLACK, WHITE, 0, 0, 4);  // 年
			LCD_ShowNum(80, 40, MyRTC_Time[1], LCD_8X16, WHITE, BLACK, 0, 1, 2);  // 月
			LCD_ShowNum(104, 40, MyRTC_Time[2], LCD_8X16, BLACK, WHITE, 0, 1, 2); // 日
			LCD_ShowNum(48, 60, MyRTC_Time[3], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 时
			LCD_ShowNum(80, 60, MyRTC_Time[4], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 分
			LCD_ShowNum(104, 60, MyRTC_Time[5], LCD_8X16, BLACK, WHITE, 0, 1, 2); // 秒
			break;

		case 3:																	  // 设置日期
			LCD_ShowNum(40, 40, MyRTC_Time[0], LCD_8X16, BLACK, WHITE, 0, 0, 4);  // 年
			LCD_ShowNum(80, 40, MyRTC_Time[1], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 月
			LCD_ShowNum(104, 40, MyRTC_Time[2], LCD_8X16, WHITE, BLACK, 0, 1, 2); // 日
			LCD_ShowNum(48, 60, MyRTC_Time[3], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 时
			LCD_ShowNum(80, 60, MyRTC_Time[4], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 分
			LCD_ShowNum(104, 60, MyRTC_Time[5], LCD_8X16, BLACK, WHITE, 0, 1, 2); // 秒
			break;

		case 4:																	  // 设置小时
			LCD_ShowNum(40, 40, MyRTC_Time[0], LCD_8X16, BLACK, WHITE, 0, 0, 4);  // 年
			LCD_ShowNum(80, 40, MyRTC_Time[1], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 月
			LCD_ShowNum(104, 40, MyRTC_Time[2], LCD_8X16, BLACK, WHITE, 0, 1, 2); // 日
			LCD_ShowNum(48, 60, MyRTC_Time[3], LCD_8X16, WHITE, BLACK, 0, 1, 2);  // 时
			LCD_ShowNum(80, 60, MyRTC_Time[4], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 分
			LCD_ShowNum(104, 60, MyRTC_Time[5], LCD_8X16, BLACK, WHITE, 0, 1, 2); // 秒
			break;

		case 5:																	  // 设置分钟
			LCD_ShowNum(40, 40, MyRTC_Time[0], LCD_8X16, BLACK, WHITE, 0, 0, 4);  // 年
			LCD_ShowNum(80, 40, MyRTC_Time[1], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 月
			LCD_ShowNum(104, 40, MyRTC_Time[2], LCD_8X16, BLACK, WHITE, 0, 1, 2); // 日
			LCD_ShowNum(48, 60, MyRTC_Time[3], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 时
			LCD_ShowNum(80, 60, MyRTC_Time[4], LCD_8X16, WHITE, BLACK, 0, 1, 2);  // 分
			LCD_ShowNum(104, 60, MyRTC_Time[5], LCD_8X16, BLACK, WHITE, 0, 1, 2); // 秒
			break;

		case 6:																	  // 设置秒
			LCD_ShowNum(40, 40, MyRTC_Time[0], LCD_8X16, BLACK, WHITE, 0, 0, 4);  // 年
			LCD_ShowNum(80, 40, MyRTC_Time[1], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 月
			LCD_ShowNum(104, 40, MyRTC_Time[2], LCD_8X16, BLACK, WHITE, 0, 1, 2); // 日
			LCD_ShowNum(48, 60, MyRTC_Time[3], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 时
			LCD_ShowNum(80, 60, MyRTC_Time[4], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 分
			LCD_ShowNum(104, 60, MyRTC_Time[5], LCD_8X16, WHITE, BLACK, 0, 1, 2); // 秒
			break;
		}
	}
}

int Menu3_SetLight(void)
{
	static uint16_t LastLightValue = 0xFFFF;
	LCD_ShowChinese(0, 0, "设置", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 40, "日期时间", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 60, "光照阈值", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 80, "温度阈值", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 100, "单次步长", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowNum(72, 100, StepLength, LCD_8X16, BLACK, WHITE, 0, 0, 0);
	LCD_ShowNum(72, 60, LightValue, LCD_8X16, BLACK, WHITE, 0, 0, 0);
	LCD_ShowNum(72, 80, TempValue, LCD_8X16, BLACK, WHITE, 0, 0, 0);
	LCD_ShowString(64, 60, ">", LCD_8X16, WHITE, BLACK, 0);
	LastLightValue = LightValue;

	while (1)
	{
		if (Key_Check(KEY_1, KEY_UP) || Key_Check(KEY_1, KEY_REPEAT))
		{
			LightValue = LightValue - StepLength;
			if (LightValue <= 1)
			{
				LightValue = 400;
			}
		}
		if (Key_Check(KEY_2, KEY_UP) || Key_Check(KEY_2, KEY_REPEAT))
		{
			LightValue = LightValue + StepLength;
			if (LightValue >= 400)
			{
				LightValue = 1;
			}
		}
		if (Key_Check(KEY_3, KEY_SINGLE))
		{
			LCD_Clear(WHITE);
			LastLightValue = 0xFFFF;
			return 0;
		}

		if (LightValue != LastLightValue)
		{
			LCD_DrawRectangle_Fill(72, 60, 110, 75, WHITE);
			LCD_ShowNum(72, 60, LightValue, LCD_8X16, BLACK, WHITE, 0, 0, 0);
			LastLightValue = LightValue;
		}
	}
}

int Menu3_SetTemp(void)
{
	static uint8_t LastTempValue = 0xFF;
	LCD_ShowChinese(0, 0, "设置", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 40, "日期时间", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 60, "光照阈值", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 80, "温度阈值", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 100, "单次步长", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowNum(72, 100, StepLength, LCD_8X16, BLACK, WHITE, 0, 0, 0);
	LCD_ShowNum(72, 60, LightValue, LCD_8X16, BLACK, WHITE, 0, 0, 0);
	LCD_ShowNum(72, 80, TempValue, LCD_8X16, BLACK, WHITE, 0, 0, 0);
	LCD_ShowString(64, 80, ">", LCD_8X16, WHITE, BLACK, 0);
	LastTempValue = TempValue;

	while (1)
	{
		if (Key_Check(KEY_1, KEY_UP) || Key_Check(KEY_1, KEY_REPEAT))
		{
			TempValue = TempValue - StepLength;
			if (TempValue <= 1)
			{
				TempValue = 50;
			}
		}
		if (Key_Check(KEY_2, KEY_UP) || Key_Check(KEY_2, KEY_REPEAT))
		{
			TempValue = TempValue + StepLength;
			if (TempValue >= 50)
			{
				TempValue = 1;
			}
		}
		if (Key_Check(KEY_3, KEY_SINGLE))
		{
			LCD_Clear(WHITE);
			LastTempValue = 0xFF;
			return 0;
		}

		if (TempValue != LastTempValue)
		{
			LCD_DrawRectangle_Fill(72, 80, 110, 95, WHITE);
			LCD_ShowNum(72, 80, TempValue, LCD_8X16, BLACK, WHITE, 0, 0, 0);
			LastTempValue = TempValue;
		}
	}
}

int Menu3_SetLength(void)
{
	static uint8_t LastStepLength = 0xFF;
	LCD_ShowChinese(0, 0, "设置", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 40, "日期时间", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 60, "光照阈值", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 80, "温度阈值", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 100, "单次步长", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowNum(72, 100, StepLength, LCD_8X16, BLACK, WHITE, 0, 0, 0);
	LCD_ShowNum(72, 60, LightValue, LCD_8X16, BLACK, WHITE, 0, 0, 0);
	LCD_ShowNum(72, 80, TempValue, LCD_8X16, BLACK, WHITE, 0, 0, 0);
	LCD_ShowString(64, 100, ">", LCD_8X16, WHITE, BLACK, 0);
	LastStepLength = StepLength;

	while (1)
	{
		if (Key_Check(KEY_1, KEY_UP) || Key_Check(KEY_1, KEY_REPEAT))
		{
			StepLength--;
			if (StepLength == 0)
			{
				StepLength = 40;
			}
		}
		if (Key_Check(KEY_2, KEY_UP) || Key_Check(KEY_2, KEY_REPEAT))
		{
			StepLength++;
			if (StepLength == 41)
			{
				StepLength = 1;
			}
		}
		if (Key_Check(KEY_3, KEY_SINGLE))
		{
			LCD_Clear(WHITE);
			LastStepLength = 0xFF;
			return 0;
		}

		if (StepLength != LastStepLength)
		{
			LCD_DrawRectangle_Fill(72, 100, 110, 115, WHITE);
			LCD_ShowNum(72, 100, StepLength, LCD_8X16, BLACK, WHITE, 0, 0, 0);
			LastStepLength = StepLength;
		}
	}
}

int Menu3_AutoSaveSet(void)
{
	uint8_t AutoSaveFlag = 1;
	uint8_t Menu3_ToggleSaveFlag = 0;
	LCD_ShowChinese(0, 0, "历史数据", LCD_16X16, BLACK, WHITE, 1);
	LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 40, "自动存储", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 60, "存储间隔", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowString(40, 100, ":", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowString(80, 100, ":", LCD_8X16, BLACK, WHITE, 0);
	SaveInterval_Time[0] = SaveInterval / 3600;
	SaveInterval_Time[1] = (SaveInterval % 3600) / 60;
	SaveInterval_Time[2] = (SaveInterval % 3600) % 60;
	LCD_ShowNum(16, 100, SaveInterval_Time[0], LCD_8X16, BLACK, WHITE, 0, 1, 2);
	LCD_ShowNum(56, 100, SaveInterval_Time[1], LCD_8X16, BLACK, WHITE, 0, 1, 2);
	LCD_ShowNum(96, 100, SaveInterval_Time[2], LCD_8X16, BLACK, WHITE, 0, 1, 2);
	if (ToggleSaveFlag == 0)
	{
		LCD_ShowChinese(80, 40, "关", LCD_16X16, BLACK, WHITE, 0);
	}
	else
	{
		LCD_ShowChinese(80, 40, "开", LCD_16X16, BLACK, WHITE, 0);
	}
	while (1)
	{
		if (Key_Check(KEY_1, KEY_UP) || Key_Check(KEY_1, KEY_REPEAT))
		{
			AutoSaveFlag--;
			if (AutoSaveFlag == 0)
			{
				AutoSaveFlag = 3;
			}
		}
		if (Key_Check(KEY_2, KEY_UP) || Key_Check(KEY_2, KEY_REPEAT))
		{
			AutoSaveFlag++;
			if (AutoSaveFlag == 4)
			{
				AutoSaveFlag = 1;
			}
		}
		if (Key_Check(KEY_3, KEY_SINGLE))
		{
			LCD_Clear(WHITE);
			Menu3_ToggleSaveFlag = AutoSaveFlag;
		}
		if (Menu3_ToggleSaveFlag == 1)
		{
			return 0;
		}
		if (Menu3_ToggleSaveFlag == 2)
		{
			Menu3_ToggleSaveFlag = Menu4_ToggleSave();
		}
		if (Menu3_ToggleSaveFlag == 3)
		{
			Menu3_ToggleSaveFlag = Menu4_SaveInterval();
		}
		switch (AutoSaveFlag)
		{
		case 1:
		{
			LCD_ShowString(0, 20, "<---", LCD_8X16, WHITE, BLACK, 0);
			LCD_ShowChinese(0, 40, "自动存储", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 60, "存储间隔", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 0, "历史数据", LCD_16X16, BLACK, WHITE, 1);
			LCD_ShowNum(16, 100, SaveInterval_Time[0], LCD_8X16, BLACK, WHITE, 0, 1, 2);
			LCD_ShowNum(56, 100, SaveInterval_Time[1], LCD_8X16, BLACK, WHITE, 0, 1, 2);
			LCD_ShowNum(96, 100, SaveInterval_Time[2], LCD_8X16, BLACK, WHITE, 0, 1, 2);
			LCD_ShowString(40, 100, ":", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowString(80, 100, ":", LCD_8X16, BLACK, WHITE, 0);
			if (ToggleSaveFlag == 0)
			{
				LCD_ShowChinese(80, 40, "关", LCD_16X16, BLACK, WHITE, 0);
			}
			else
			{
				LCD_ShowChinese(80, 40, "开", LCD_16X16, BLACK, WHITE, 0);
			}
			break;
		}
		case 2:
		{
			LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 40, "自动存储", LCD_16X16, WHITE, BLACK, 0);
			LCD_ShowChinese(0, 60, "存储间隔", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 0, "历史数据", LCD_16X16, BLACK, WHITE, 1);
			LCD_ShowNum(16, 100, SaveInterval_Time[0], LCD_8X16, BLACK, WHITE, 0, 1, 2);
			LCD_ShowNum(56, 100, SaveInterval_Time[1], LCD_8X16, BLACK, WHITE, 0, 1, 2);
			LCD_ShowNum(96, 100, SaveInterval_Time[2], LCD_8X16, BLACK, WHITE, 0, 1, 2);
			LCD_ShowString(40, 100, ":", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowString(80, 100, ":", LCD_8X16, BLACK, WHITE, 0);
			if (ToggleSaveFlag == 0)
			{
				LCD_ShowChinese(80, 40, "关", LCD_16X16, BLACK, WHITE, 0);
			}
			else
			{
				LCD_ShowChinese(80, 40, "开", LCD_16X16, BLACK, WHITE, 0);
			}
			break;
		}
		case 3:
		{
			LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 40, "自动存储", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 60, "存储间隔", LCD_16X16, WHITE, BLACK, 0);
			LCD_ShowChinese(0, 0, "历史数据", LCD_16X16, BLACK, WHITE, 1);
			LCD_ShowNum(16, 100, SaveInterval_Time[0], LCD_8X16, BLACK, WHITE, 0, 1, 2);
			LCD_ShowNum(56, 100, SaveInterval_Time[1], LCD_8X16, BLACK, WHITE, 0, 1, 2);
			LCD_ShowNum(96, 100, SaveInterval_Time[2], LCD_8X16, BLACK, WHITE, 0, 1, 2);
			LCD_ShowString(40, 100, ":", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowString(80, 100, ":", LCD_8X16, BLACK, WHITE, 0);
			if (ToggleSaveFlag == 0)
			{
				LCD_ShowChinese(80, 40, "关", LCD_16X16, BLACK, WHITE, 0);
			}
			else
			{
				LCD_ShowChinese(80, 40, "开", LCD_16X16, BLACK, WHITE, 0);
			}
			break;
		}
		}
		if (SaveFlag == 1 && ToggleSaveFlag == 1)
		{
			MyRTC_ReadTime();
			CurrentTime.Year = MyRTC_Time[0];
			CurrentTime.Month = MyRTC_Time[1];
			CurrentTime.Day = MyRTC_Time[2];
			CurrentTime.Hour = MyRTC_Time[3];
			CurrentTime.Minute = MyRTC_Time[4];
			CurrentTime.Second = MyRTC_Time[5];
			Temp = DS18B20_Get_Temp();
			Light = LDR_LuxData();
			SaveFlag = 0;
			uint8_t saveResult = DataStorage_Save(Temp, Light, &CurrentTime);
			if (saveResult == 1)
			{
				ToggleSaveFlag = 0;
			}
		}

