bigroot969/VSCode_STM32_Demo/Hardware/Menu.c
		// 持续显示存储状态
		if (ToggleSaveFlag == 1)
		{
			LCD_ShowChinese(80, 140, "存储中", LCD_16X16, BLUE, WHITE, 1);
		}
		else
		{
			NowTotalRecords = DataStorage_GetCount();
			if (NowTotalRecords >= MaxRecordCount)
			{
				LCD_ShowChinese(80, 140, " 已满 ", LCD_16X16, RED, WHITE, 1);
			}
		}
	}
}

int Menu3_ReadRecord(void)
{
	uint8_t ReadRecordFlag = 1;
	uint8_t Menu3_ReadRecordFlag = 0;
	uint8_t RefreshFlag = 1;
	LCD_ShowChinese(0, 0, "历史数据", LCD_16X16, BLACK, WHITE, 1);
	LCD_ShowString(0, 20, "<---", LCD_8X16, WHITE, BLACK, 0);
	LCD_ShowChinese(0, 80, "光照(lux):", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 40, "日期:", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 60, "时间:", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 100, "温度(C):", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowString(0, 120, "ID:", LCD_8X16, BLACK, WHITE, 0);

	while (1)
	{
		NowTotalRecords = DataStorage_GetCount();
		if (Key_Check(KEY_1, KEY_UP) || Key_Check(KEY_1, KEY_REPEAT))
		{
			if (ShowRecordID > 0)
			{
				ShowRecordID--;
			}
			RefreshFlag = 1;
		}
		if (Key_Check(KEY_2, KEY_UP) || Key_Check(KEY_2, KEY_REPEAT))
		{
			if (ShowRecordID < NowTotalRecords - 1)
			{
				ShowRecordID++;
			}
			RefreshFlag = 1;
		}
		if (Key_Check(KEY_3, KEY_SINGLE))
		{
			LCD_Clear(WHITE);
			Menu3_ReadRecordFlag = ReadRecordFlag;
		}
		if (Menu3_ReadRecordFlag == 1)
		{
			return 0;
		}
		if (RefreshFlag)
		{
			LCD_ShowRecord(ShowRecordID);
			RefreshFlag = 0;
		}
	}
}

int Menu3_ChipErase(void)
{
	LCD_Clear(WHITE);
	uint8_t Menu3_EraseFlag = 0;
	uint8_t EraseFlag = 2;
	LCD_ShowChinese(0, 40, "确认擦除?", LCD_16X16, BLACK, WHITE, 1);
	LCD_ShowChinese(20, 72, "是", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(88, 72, "否", LCD_16X16, BLACK, WHITE, 0);
	while (1)
	{
		if (Key_Check(KEY_1, KEY_UP) || Key_Check(KEY_1, KEY_REPEAT))
		{
			EraseFlag--;
			if (EraseFlag == 0)
			{
				EraseFlag = 2;
			}
		}
		if (Key_Check(KEY_2, KEY_UP) || Key_Check(KEY_2, KEY_REPEAT))
		{
			EraseFlag++;
			if (EraseFlag == 3)
			{
				EraseFlag = 1;
			}
		}
		if (Key_Check(KEY_3, KEY_SINGLE))
		{
			LCD_Clear(WHITE);
			Menu3_EraseFlag = EraseFlag;
		}
		if (Menu3_EraseFlag == 1)
		{
			Menu4_Erase();
			return 0;
		}
		if (Menu3_EraseFlag == 2)
		{
			return 0;
		}
		switch (EraseFlag)
		{
		case 1:
		{
			LCD_ShowChinese(20, 72, "是", LCD_16X16, WHITE, BLACK, 0);
			LCD_ShowChinese(88, 72, "否", LCD_16X16, BLACK, WHITE, 0);
			break;
		}
		case 2:
		{
			LCD_ShowChinese(20, 72, "是", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(88, 72, "否", LCD_16X16, WHITE, BLACK, 0);
			break;
		}
		}
	}
}

int Menu3_SetMaxRecord(void)
{
	uint8_t tempMax = MaxRecordCount;
	while (1)
	{
		if (ToggleSaveFlag == 0)
		{
			if (Key_Check(KEY_1, KEY_UP) || Key_Check(KEY_1, KEY_REPEAT))
			{
				tempMax--;
				if (tempMax == 0)
				{
					tempMax = 250;
				}
			}
			if (Key_Check(KEY_2, KEY_UP) || Key_Check(KEY_2, KEY_REPEAT))
			{
				tempMax++;
				if (tempMax == 251)
				{
					tempMax = 1;
				}
			}
			if (Key_Check(KEY_3, KEY_SINGLE))
			{
				uint8_t saveResult = DataStorage_SetMaxRecord(tempMax);
				LCD_Clear(WHITE);
				return 0;
			}
		}
		LCD_ShowChinese(0, 0, "历史数据", LCD_16X16, BLACK, WHITE, 1);
		LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
		LCD_ShowChinese(0, 40, "自动存储", LCD_16X16, BLACK, WHITE, 0);
		LCD_ShowChinese(0, 60, "读取记录", LCD_16X16, BLACK, WHITE, 0);
		LCD_ShowChinese(0, 80, "擦除数据", LCD_16X16, BLACK, WHITE, 0);
		LCD_ShowChinese(0, 100, "最大记录数", LCD_16X16, BLACK, WHITE, 0);
		LCD_ShowChinese(0, 120, "当前记录数", LCD_16X16, BLACK, WHITE, 0);
		LCD_ShowNum(96, 100, tempMax, LCD_8X16, BLACK, WHITE, 0, 0, 0);
		LCD_ShowNum(96, 120, NowTotalRecords, LCD_8X16, BLACK, WHITE, 0, 0, 0);
		LCD_ShowString(80, 100, ">", LCD_8X16, BLACK, WHITE, 0);
		if (ToggleSaveFlag == 0)
		{
			LCD_ShowChinese(80, 40, "关", LCD_16X16, BLACK, WHITE, 0);
		}
		else
		{
			LCD_ShowChinese(80, 40, "开", LCD_16X16, BLACK, WHITE, 0);
		}
	}
}

int Menu4_Erase(void)
{
	LCD_Clear(WHITE);
	LCD_ShowChinese(0, 40, "擦除中...", LCD_16X16, RED, WHITE, 1);
	W25Q64_SectorErase(STORAGE_START_ADDR);
	DataStorage_ResetCount();
	DataStorage_Init();
	NowTotalRecords = DataStorage_GetCount();
	Delay_s(3);
	LCD_Clear(WHITE);
	return 0;
}

int Menu4_Start_StopWatch(void)
{
	StopWatchStartFlag = 1;
	return 0;
}

int Menu4_Pause_StopWatch(void)
{
	StopWatchStartFlag = 0;
	return 0;
}

int Menu4_Clear_StopWatch(void)
{
	StopWatchStartFlag = 0;
	hour = minute = second = 0;
	return 0;
}

int Menu3_StopWatch(void)
{
	uint8_t StopWatchFlag = 1;
	uint8_t StopWatchTemp = 0;
	static uint8_t LastHour = 0xFF, LastMinute = 0xFF, LastSecond = 0xFF;

	LCD_ShowChinese(0, 0, "秒表", LCD_16X16, BLACK, WHITE, 1);
	LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowChinese(8, 100, "开始", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(48, 100, "暂停", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(88, 100, "清除", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowString(48, 60, ":", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowString(72, 60, ":", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowNum(32, 60, hour, LCD_8X16, BLACK, WHITE, 0, 1, 2);
	LCD_ShowNum(56, 60, minute, LCD_8X16, BLACK, WHITE, 0, 1, 2);
	LCD_ShowNum(80, 60, second, LCD_8X16, BLACK, WHITE, 0, 1, 2);
	LastHour = hour;
	LastMinute = minute;
	LastSecond = second;

	while (1)
	{
		if (Key_Check(KEY_1, KEY_UP) || Key_Check(KEY_1, KEY_REPEAT))
		{
			StopWatchFlag--;
			if (StopWatchFlag == 0)
			{
				StopWatchFlag = 4;
			}
		}
		if (Key_Check(KEY_2, KEY_UP) || Key_Check(KEY_2, KEY_REPEAT))
		{
			StopWatchFlag++;
			if (StopWatchFlag == 5)
			{
				StopWatchFlag = 1;
			}
		}
		if (Key_Check(KEY_3, KEY_SINGLE))
		{
			StopWatchTemp = StopWatchFlag;
		}
		if (StopWatchTemp == 1)
		{
			LastHour = LastMinute = LastSecond = 0xFF;
			StopWatchStartFlag = 0;
			return 0;
		}
		if (StopWatchTemp == 2)
		{
			Menu4_Start_StopWatch();
			StopWatchTemp = 0;
		}
		if (StopWatchTemp == 3)
		{
			Menu4_Pause_StopWatch();
			StopWatchTemp = 0;
		}
		if (StopWatchTemp == 4)
		{
			Menu4_Clear_StopWatch();
			StopWatchTemp = 0;
		}

		// 只在时间改变时更新显示
		if (hour != LastHour)
		{
			LCD_DrawRectangle_Fill(32, 60, 46, 75, WHITE);
			LCD_ShowNum(32, 60, hour, LCD_8X16, BLACK, WHITE, 0, 1, 2);
			LastHour = hour;
		}
		if (minute != LastMinute)
		{
			LCD_DrawRectangle_Fill(56, 60, 70, 75, WHITE);
			LCD_ShowNum(56, 60, minute, LCD_8X16, BLACK, WHITE, 0, 1, 2);
			LastMinute = minute;
		}
		if (second != LastSecond)
		{
			LCD_DrawRectangle_Fill(80, 60, 94, 75, WHITE);
			LCD_ShowNum(80, 60, second, LCD_8X16, BLACK, WHITE, 0, 1, 2);
			LastSecond = second;
		}

		switch (StopWatchFlag)
		{
		case 1:
		{
			LCD_ShowChinese(0, 0, "秒表", LCD_16X16, BLACK, WHITE, 1);
			LCD_ShowString(0, 20, "<---", LCD_8X16, WHITE, BLACK, 0);
			LCD_ShowChinese(8, 100, "开始", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(48, 100, "暂停", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(88, 100, "清除", LCD_16X16, BLACK, WHITE, 0);
			break;
		}
		case 2:
		{
			LCD_ShowChinese(0, 0, "秒表", LCD_16X16, BLACK, WHITE, 1);
			LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowChinese(8, 100, "开始", LCD_16X16, WHITE, BLACK, 0);
			LCD_ShowChinese(48, 100, "暂停", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(88, 100, "清除", LCD_16X16, BLACK, WHITE, 0);
			break;
		}
		case 3:
		{
			LCD_ShowChinese(0, 0, "秒表", LCD_16X16, BLACK, WHITE, 1);
			LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowChinese(8, 100, "开始", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(48, 100, "暂停", LCD_16X16, WHITE, BLACK, 0);
			LCD_ShowChinese(88, 100, "清除", LCD_16X16, BLACK, WHITE, 0);
			break;
		}
		case 4:
		{
			LCD_ShowChinese(0, 0, "秒表", LCD_16X16, BLACK, WHITE, 1);
			LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowChinese(8, 100, "开始", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(48, 100, "暂停", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(88, 100, "清除", LCD_16X16, WHITE, BLACK, 0);
			break;
		}
		}
	}
}

