bigroot969/VSCode_STM32_Demo/Hardware/Menu.c
int Menu4_ToggleSave(void)
{
	LCD_ShowChinese(0, 0, "历史数据", LCD_16X16, BLACK, WHITE, 1);
	SaveInterval_Time[0] = SaveInterval / 3600;
	SaveInterval_Time[1] = (SaveInterval % 3600) / 60;
	SaveInterval_Time[2] = (SaveInterval % 3600) % 60;
	LCD_ShowString(40, 100, ":", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowString(80, 100, ":", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowNum(16, 100, SaveInterval_Time[0], LCD_8X16, BLACK, WHITE, 0, 1, 2);
	LCD_ShowNum(56, 100, SaveInterval_Time[1], LCD_8X16, BLACK, WHITE, 0, 1, 2);
	LCD_ShowNum(96, 100, SaveInterval_Time[2], LCD_8X16, BLACK, WHITE, 0, 1, 2);
	while (1)
	{
		if (Key_Check(KEY_1, KEY_UP) || Key_Check(KEY_1, KEY_REPEAT))
		{
			ToggleSaveFlag = !ToggleSaveFlag;
		}
		if (Key_Check(KEY_2, KEY_UP) || Key_Check(KEY_2, KEY_REPEAT))
		{
			ToggleSaveFlag = !ToggleSaveFlag;
		}
		if (Key_Check(KEY_3, KEY_SINGLE))
		{
			LCD_Clear(WHITE);
			return 0;
		}
		LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
		LCD_ShowChinese(0, 40, "自动存储", LCD_16X16, BLACK, WHITE, 0);
		LCD_ShowChinese(0, 60, "存储间隔", LCD_16X16, BLACK, WHITE, 0);
		LCD_ShowString(72, 40, ">", LCD_8X16, WHITE, BLACK, 0);
		if (ToggleSaveFlag == 0)
		{
			LCD_ShowChinese(80, 40, "关", LCD_16X16, BLACK, WHITE, 0);
		}
		else
		{
			LCD_ShowChinese(80, 40, "开", LCD_16X16, BLACK, WHITE, 0);
		}
	}
}

int Menu4_SaveInterval(void)
{
	uint8_t SaveIntervalFlag = 1;
	uint8_t SwitchFlag = 0;
	LCD_ShowChinese(0, 0, "历史数据", LCD_16X16, BLACK, WHITE, 1);
	LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 40, "自动存储", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 60, "存储间隔", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowString(40, 100, ":", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowString(80, 100, ":", LCD_8X16, BLACK, WHITE, 0);
	SaveInterval_Time[0] = SaveInterval / 3600;
	SaveInterval_Time[1] = (SaveInterval % 3600) / 60;
	SaveInterval_Time[2] = (SaveInterval % 3600) % 60;
	while (1)
	{
		if (SwitchFlag == 0)
		{
			if (Key_Check(KEY_1, KEY_UP) || Key_Check(KEY_1, KEY_REPEAT)) // KEY_1：上一项（小时→秒循环）
			{
				SaveIntervalFlag--;
				if (SaveIntervalFlag == 0)
				{
					SaveIntervalFlag = 3;
				}
			}
			else if (Key_Check(KEY_2, KEY_UP)) // KEY_2：下一项（秒→小时循环）
			{
				SaveIntervalFlag++;
				if (SaveIntervalFlag == 4)
				{
					SaveIntervalFlag = 1;
				}
			}
		}
		else if (SwitchFlag == 1)
		{
			if (Key_Check(KEY_1, KEY_UP) || Key_Check(KEY_1, KEY_REPEAT)) // KEY_1：减少
			{
				switch (SaveIntervalFlag)
				{
				case 1:
				{
					SaveInterval_Time[0]--;
					if (SaveInterval_Time[0] < 0)
					{
						SaveInterval_Time[0] = 23;
					}
					break;
				}
				case 2:
				{
					SaveInterval_Time[1]--;
					if (SaveInterval_Time[1] < 0)
					{
						SaveInterval_Time[1] = 59;
					}
					break;
				}
				case 3:
				{
					SaveInterval_Time[2]--;
					if (SaveInterval_Time[2] < 0)
					{
						SaveInterval_Time[2] = 59;
					}
					break;
				}
				}
				SaveInterval = SaveInterval_Time[0] * 3600 + SaveInterval_Time[1] * 60 + SaveInterval_Time[2];
			}
			else if (Key_Check(KEY_2, KEY_UP))
			{
				switch (SaveIntervalFlag)
				{
				case 1:
				{
					SaveInterval_Time[0]++;
					if (SaveInterval_Time[0] == 24)
					{
						SaveInterval_Time[0] = 0;
					}
					break;
				}
				case 2:
				{
					SaveInterval_Time[1]++;
					if (SaveInterval_Time[1] == 60)
					{
						SaveInterval_Time[1] = 0;
					}
					break;
				}
				case 3:
				{
					SaveInterval_Time[2]++;
					if (SaveInterval_Time[2] == 60)
					{
						SaveInterval_Time[2] = 0;
					}
					break;
				}
				}
				SaveInterval = SaveInterval_Time[0] * 3600 + SaveInterval_Time[1] * 60 + SaveInterval_Time[2];
			}
		}
		if (Key_Check(KEY_3, KEY_SINGLE))
		{
			SwitchFlag = !SwitchFlag;
		}
		else if (Key_Check(KEY_3, KEY_LONG))
		{
			LCD_Clear(WHITE);
			return 0;
		}
		switch (SaveIntervalFlag)
		{
		case 1:
		{
			LCD_ShowNum(16, 100, SaveInterval_Time[0], LCD_8X16, WHITE, BLACK, 0, 1, 2);
			LCD_ShowNum(56, 100, SaveInterval_Time[1], LCD_8X16, BLACK, WHITE, 0, 1, 2);
			LCD_ShowNum(96, 100, SaveInterval_Time[2], LCD_8X16, BLACK, WHITE, 0, 1, 2);
			break;
		}
		case 2:
		{
			LCD_ShowNum(16, 100, SaveInterval_Time[0], LCD_8X16, BLACK, WHITE, 0, 1, 2);
			LCD_ShowNum(56, 100, SaveInterval_Time[1], LCD_8X16, WHITE, BLACK, 0, 1, 2);
			LCD_ShowNum(96, 100, SaveInterval_Time[2], LCD_8X16, BLACK, WHITE, 0, 1, 2);
			break;
		}
		case 3:
		{
			LCD_ShowNum(16, 100, SaveInterval_Time[0], LCD_8X16, BLACK, WHITE, 0, 1, 2);
			LCD_ShowNum(56, 100, SaveInterval_Time[1], LCD_8X16, BLACK, WHITE, 0, 1, 2);
			LCD_ShowNum(96, 100, SaveInterval_Time[2], LCD_8X16, WHITE, BLACK, 0, 1, 2);
			break;
		}
		}
		if (ToggleSaveFlag == 0)
		{
			LCD_ShowChinese(80, 40, "关", LCD_16X16, BLACK, WHITE, 0);
		}
		else
		{
			LCD_ShowChinese(80, 40, "开", LCD_16X16, BLACK, WHITE, 0);
		}
		if (SwitchFlag == 0)
		{
			LCD_ShowChinese(0, 120, "切换", LCD_16X16, BLACK, WHITE, 1);
		}
		else
		{
			LCD_ShowChinese(0, 120, "调整", LCD_16X16, BLACK, WHITE, 1);
		}
	}
}

void LCD_ShowRecord(uint8_t RecordID)
{
	SensorData record;
	NowTotalRecords = DataStorage_GetCount();
	if (RecordID >= NowTotalRecords)
	{
		LCD_ShowChinese(32, 120, "无记录", LCD_16X16, BLACK, WHITE, 0);
		return;
	}
	DataStorage_Read(RecordID, &record);
	char IndexStr[20];
	float temp = record.Temp / 10.0f;
	sprintf((char *)IndexStr, "%03d/%03d", record.Index, NowTotalRecords);
	LCD_ShowString(32, 120, IndexStr, LCD_8X16, BLACK, WHITE, 0);
	LCD_DrawRectangle_Fill(40, 40, 70, 55, WHITE);
	LCD_DrawRectangle_Fill(80, 40, 94, 55, WHITE);
	LCD_DrawRectangle_Fill(104, 40, 118, 55, WHITE);
	LCD_DrawRectangle_Fill(40, 60, 54, 75, WHITE);
	LCD_DrawRectangle_Fill(64, 60, 78, 75, WHITE);
	LCD_DrawRectangle_Fill(88, 60, 102, 75, WHITE);
	LCD_DrawRectangle_Fill(88, 80, 120, 95, WHITE);
	LCD_DrawRectangle_Fill(72, 100, 120, 115, WHITE);
	LCD_ShowNum(40, 40, record.Year, LCD_8X16, BLACK, WHITE, 0, 0, 0);	 // 年
	LCD_ShowNum(80, 40, record.Month, LCD_8X16, BLACK, WHITE, 0, 0, 0);	 // 月
	LCD_ShowNum(104, 40, record.Day, LCD_8X16, BLACK, WHITE, 0, 0, 0);	 // 日
	LCD_ShowNum(40, 60, record.Hour, LCD_8X16, BLACK, WHITE, 0, 0, 0);	 // 时
	LCD_ShowNum(64, 60, record.Minute, LCD_8X16, BLACK, WHITE, 0, 0, 0); // 分
	LCD_ShowNum(88, 60, record.Second, LCD_8X16, BLACK, WHITE, 0, 0, 0); // 秒
	LCD_ShowNum(88, 80, record.Light, LCD_8X16, BLACK, WHITE, 0, 1, 3);
	LCD_ShowFloatNum(72, 100, temp, 1, LCD_8X16, BLACK, WHITE, 0);

	LCD_ShowString(72, 40, "-", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowString(96, 40, "-", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowString(56, 60, ":", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowString(80, 60, ":", LCD_8X16, BLACK, WHITE, 0);
}

void StopWatch_Tick(void)
{
	static uint16_t StopWatchCount;
	StopWatchCount++;
	if (StopWatchCount >= 1000)
	{
		StopWatchCount = 0;
		if (StopWatchStartFlag == 1)
		{
			second++;
			if (second >= 60)
			{
				second = 0;
				minute++;
				if (minute >= 60)
				{
					minute = 0;
					hour++;
					if (hour > 99)
					{
						hour = 0;
					}
				}
			}
		}
	}
}

void TIM4_IRQHandler(void)
{
	if (TIM_GetITStatus(TIM4, TIM_IT_Update) == SET)
	{
		Key_Tick();
		StopWatch_Tick();
		TIM_ClearITPendingBit(TIM4, TIM_IT_Update);
	}
}

void TIM2_IRQHandler(void)
{
	if (TIM_GetITStatus(TIM2, TIM_IT_Update) == SET)
	{
		TimerCount++;
		if (TimerCount >= SaveInterval)
		{
			TimerCount = 0;
			SaveFlag = 1;
		}
		TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
	}
}
